artifacts/bench/20260421T130355Z/extreme_limit/stdout.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: /scripts/main.js
        output: -

     scenarios: (100.00%) 1 scenario, 400 max VUs, 1m0s max duration (incl. graceful stop):
              * main: 1000.00 iterations/s for 30s (maxVUs: 50-400, exec: run, gracefulStop: 30s)

time="2026-04-21T13:03:56Z" level=warning msg="Error from API server" error="listen tcp 127.0.0.1:6565: bind: address already in use"

running (0m01.0s), 006/050 VUs, 978 complete and 0 interrupted iterations
main   [   3% ] 006/050 VUs  01.0s/30s  1000.00 iters/s

running (0m02.0s), 006/050 VUs, 1977 complete and 0 interrupted iterations
main   [   7% ] 007/050 VUs  02.0s/30s  1000.00 iters/s

running (0m03.0s), 009/050 VUs, 2975 complete and 0 interrupted iterations
main   [  10% ] 009/050 VUs  03.0s/30s  1000.00 iters/s

running (0m04.0s), 010/050 VUs, 3973 complete and 0 interrupted iterations
main   [  13% ] 010/050 VUs  04.0s/30s  1000.00 iters/s

running (0m05.0s), 007/050 VUs, 4977 complete and 0 interrupted iterations
main   [  17% ] 007/050 VUs  05.0s/30s  1000.00 iters/s

running (0m06.0s), 013/050 VUs, 5971 complete and 0 interrupted iterations
main   [  20% ] 013/050 VUs  06.0s/30s  1000.00 iters/s

running (0m07.0s), 011/050 VUs, 6972 complete and 0 interrupted iterations
main   [  23% ] 011/050 VUs  07.0s/30s  1000.00 iters/s

running (0m08.0s), 007/050 VUs, 7977 complete and 0 interrupted iterations
main   [  27% ] 007/050 VUs  08.0s/30s  1000.00 iters/s

running (0m09.0s), 013/050 VUs, 8972 complete and 0 interrupted iterations
main   [  30% ] 013/050 VUs  09.0s/30s  1000.00 iters/s

running (0m10.0s), 007/050 VUs, 9976 complete and 0 interrupted iterations
main   [  33% ] 007/050 VUs  10.0s/30s  1000.00 iters/s

running (0m11.0s), 009/050 VUs, 10975 complete and 0 interrupted iterations
main   [  37% ] 009/050 VUs  11.0s/30s  1000.00 iters/s

running (0m12.0s), 005/050 VUs, 11977 complete and 0 interrupted iterations
main   [  40% ] 005/050 VUs  12.0s/30s  1000.00 iters/s

running (0m13.0s), 009/050 VUs, 12975 complete and 0 interrupted iterations
main   [  43% ] 009/050 VUs  13.0s/30s  1000.00 iters/s

running (0m14.0s), 009/050 VUs, 13975 complete and 0 interrupted iterations
main   [  47% ] 009/050 VUs  14.0s/30s  1000.00 iters/s

running (0m15.0s), 012/050 VUs, 14970 complete and 0 interrupted iterations
main   [  50% ] 012/050 VUs  15.0s/30s  1000.00 iters/s

running (0m16.0s), 010/050 VUs, 15973 complete and 0 interrupted iterations
main   [  53% ] 010/050 VUs  16.0s/30s  1000.00 iters/s

running (0m17.0s), 007/050 VUs, 16977 complete and 0 interrupted iterations
main   [  57% ] 007/050 VUs  17.0s/30s  1000.00 iters/s

running (0m18.0s), 006/050 VUs, 17977 complete and 0 interrupted iterations
main   [  60% ] 006/050 VUs  18.0s/30s  1000.00 iters/s

running (0m19.0s), 010/050 VUs, 18974 complete and 0 interrupted iterations
main   [  63% ] 010/050 VUs  19.0s/30s  1000.00 iters/s

running (0m20.0s), 100/120 VUs, 19760 complete and 0 interrupted iterations
main   [  67% ] 100/120 VUs  20.0s/30s  1000.00 iters/s

running (0m21.0s), 010/143 VUs, 20810 complete and 0 interrupted iterations
main   [  70% ] 010/143 VUs  21.0s/30s  1000.00 iters/s

running (0m22.0s), 315/317 VUs, 21200 complete and 0 interrupted iterations
main   [  73% ] 315/317 VUs  22.0s/30s  1000.00 iters/s
time="2026-04-21T13:04:19Z" level=warning msg="Insufficient VUs, reached 400 active VUs and cannot initialize more" executor=constant-arrival-rate scenario=main

running (0m23.0s), 398/400 VUs, 21886 complete and 0 interrupted iterations
main   [  77% ] 398/400 VUs  23.0s/30s  1000.00 iters/s

running (0m24.0s), 107/400 VUs, 23135 complete and 0 interrupted iterations
main   [  80% ] 107/400 VUs  24.0s/30s  1000.00 iters/s

running (0m25.0s), 398/400 VUs, 23600 complete and 0 interrupted iterations
main   [  83% ] 398/400 VUs  25.0s/30s  1000.00 iters/s

running (0m26.0s), 158/400 VUs, 24702 complete and 0 interrupted iterations
main   [  87% ] 158/400 VUs  26.0s/30s  1000.00 iters/s

running (0m27.0s), 400/400 VUs, 25127 complete and 0 interrupted iterations
main   [  90% ] 400/400 VUs  27.0s/30s  1000.00 iters/s

running (0m28.0s), 121/400 VUs, 25936 complete and 0 interrupted iterations
main   [  93% ] 121/400 VUs  28.0s/30s  1000.00 iters/s

running (0m29.0s), 394/400 VUs, 26662 complete and 0 interrupted iterations
main   [  97% ] 394/400 VUs  29.0s/30s  1000.00 iters/s

running (0m30.0s), 398/400 VUs, 27101 complete and 0 interrupted iterations
main   [ 100% ] 398/400 VUs  30.0s/30s  1000.00 iters/s

     ✓ get post 200
     ✓ hot feed 200
     ✓ like 200
     ✓ create post 201

     checks.........................: 100.00% ✓ 27516      ✗ 0    
     data_received..................: 159 MB  5.2 MB/s
     data_sent......................: 3.7 MB  121 kB/s
     dropped_iterations.............: 2485    81.715557/s
     http_req_blocked...............: avg=13.13µs  min=982ns    med=4.26µs  max=11.11ms p(90)=5.44µs   p(95)=7.7µs   
     http_req_connecting............: avg=5.88µs   min=0s       med=0s      max=11.02ms p(90)=0s       p(95)=0s      
   ✗ http_req_duration..............: avg=113.34ms min=928.12µs med=10.61ms max=1.37s   p(90)=407.22ms p(95)=690.64ms
       { expected_response:true }...: avg=113.34ms min=928.12µs med=10.61ms max=1.37s   p(90)=407.22ms p(95)=690.64ms
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 27516
     http_req_receiving.............: avg=192.32µs min=12.55µs  med=86.15µs max=29.81ms p(90)=418.32µs p(95)=616.35µs
     http_req_sending...............: avg=30.63µs  min=5.15µs   med=17.82µs max=3.16ms  p(90)=42.59µs  p(95)=92.92µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=113.12ms min=846.4µs  med=10.4ms  max=1.37s   p(90)=406.94ms p(95)=690.49ms
     http_reqs......................: 27516   904.823043/s
     iteration_duration.............: avg=113.55ms min=1.09ms   med=10.78ms max=1.37s   p(90)=407.33ms p(95)=690.81ms
     iterations.....................: 27516   904.823043/s
     vus............................: 399     min=5        max=399
     vus_max........................: 400     min=50       max=400


running (0m30.4s), 000/400 VUs, 27516 complete and 0 interrupted iterations
main ✓ [ 100% ] 000/400 VUs  30s  1000.00 iters/s
time="2026-04-21T13:04:26Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/out/summary.json': open /out/summary.json: permission denied"
time="2026-04-21T13:04:26Z" level=error msg="thresholds on metrics 'http_req_duration' have been crossed"